/* Accept Friend Request Alert Button Title */
"ACCEPT_FRIEND_REQUEST_BUTTON_TITLE" = "Hyväksy";

/* Accept game invite Alert Button Title */
"ACCEPT_INVITE_BUTTON_TITLE" = "Hyväksy";

/* Account disabled alert message */
"ACCOUNT_DISABLED_ALERT_MESSAGE" = "Syöttämäsi Apple ID on poistettu käytöstä turvallisuussyistä. Muuta salasana koskettamalla Nollaa.";

/* You are not allowed to modify accounts on this device (alert text) */
"ACCOUNT_RESTRICTED_CREATE_TEXT" = "Et voi muuttaa tiliäsi tällä laitteella";

/* Cannot create account (alert title) */
"ACCOUNT_RESTRICTED_CREATE_TITLE" = "Tiliä ei voida luoda";

/* You are not allowed to edit your account on this device (alert text) */
"ACCOUNT_RESTRICTED_EDIT_TEXT" = "Et voi muokata tiliäsi tällä laitteella";

/* Cannot edit account (alert title) */
"ACCOUNT_RESTRICTED_EDIT_TITLE" = "Tiliä ei voida muokata";

/* You are not allowed to sign in to this device (alert text) */
"ACCOUNT_RESTRICTED_SIGNIN_TEXT" = "Et voi kirjautua tälle laitteelle";

/* Cannot sign in (alert title) */
"ACCOUNT_RESTRICTED_SIGNIN_TITLE" = "Ei voida kirjautua sisään";

/* Account Title */
"ACCOUNT_TITLE" = "Tili";

/* Achievements title one player */
"ACHIEVEMENTS" = "Saavutukset";

/* Achievement User Title points tally compare screen (plural, plural form) */
"ACHIEVEMENTS_1_POINTS_2_PLURAL_PLURAL" = "%1$@ saavutusta, %2$@ pistettä";

/* Achievement User Title points tally compare screen (plural, singular form) */
"ACHIEVEMENTS_1_POINTS_2_PLURAL_SINGULAR" = "%1$@ saavutusta, %2$@ piste";

/* Achievement User Title points tally compare screen (plural, zero form) */
"ACHIEVEMENTS_1_POINTS_2_PLURAL_ZERO" = "%1$@ saavutusta, %2$@ pistettä";

/* Achievement User Title points tally compare screen (singular, plural form) */
"ACHIEVEMENTS_1_POINTS_2_SINGULAR_PLURAL" = "%1$@ saavutus, %2$@ pistettä";

/* Achievement User Title points tally compare screen (singular form) */
"ACHIEVEMENTS_1_POINTS_2_SINGULAR_SINGULAR" = "%1$@ saavutus, %2$@ piste";

/* Achievement User Title points tally compare screen (singular, zero form) */
"ACHIEVEMENTS_1_POINTS_2_SINGULAR_ZERO" = "%1$@ saavutus, %2$@ pistettä";

/* Achievement User Title points tally compare screen (zero, zero form) */
"ACHIEVEMENTS_1_POINTS_2_ZERO_ZERO" = "%1$@ saavutusta, %2$@ pistettä";

/* # of max # achievements format (plural) */
"ACHIEVEMENTS_N1_OF_M2_PLURAL" = "%1$@ / %2$@ saavutusta ";

/* # of max # achievements format (singular) */
"ACHIEVEMENTS_N1_OF_M2_SINGULAR" = "%1$@ / %2$@ saavutus ";

/* Achievements Section Title total for unowned games (plural) */
"ACHIEVEMENT_COUNT_TITLE_PLURAL" = "%@ saavutusta ";

/* Achievements Section Title total for unowned games (singular) */
"ACHIEVEMENT_COUNT_TITLE_SINGULAR" = "%@ saavutus ";

/* Achievements Section Title total for unowned games (uppercase, plural) */
"ACHIEVEMENT_COUNT_TITLE_UPPERCASE_PLURAL" = "%@ SAAVUTUSTA ";

/* Achievements Section Title total for unowned games (uppercase, singular) */
"ACHIEVEMENT_COUNT_TITLE_UPPERCASE_SINGULAR" = "%@ SAAVUTUS ";

/* Achievements Section Title total for unowned games (uppercase, zero) */
"ACHIEVEMENT_COUNT_TITLE_UPPERCASE_ZERO" = "EI SAAVUTUKSIA ";

/* Achievements Section Title total for unowned games (zero) */
"ACHIEVEMENT_COUNT_TITLE_ZERO" = "Ei saavutuksia ";

/* Achievement earned: date. */
"ACHIEVEMENT_EARNED_DATE" = "Ansaittu: ";

/* Achievement earned on: date. */
"ACHIEVEMENT_EARNED_ON_DATE" = "Ansaittu: %1$@";

/* Achievement User Title number of achievements.used when value is >1 */
"ACHIEVEMENT_N1_OF_M2_PLURAL" = "%1$@ / %2$@ saavutusta ";

/* Achievement User Title number of achievements.used when value is 1 */
"ACHIEVEMENT_N1_OF_M2_SINGULAR" = "%1$@ / %2$@ saavutus ";

/* Achievement User Title number of achievements.used when value is >1 */
"ACHIEVEMENT_N1_OF_M2_UPPERCASE_PLURAL" = "%1$@ / %2$@ SAAVUTUSTA";

/* Achievement User Title number of achievements.used when value is 1 */
"ACHIEVEMENT_N1_OF_M2_UPPERCASE_SINGULAR" = "%1$@ / %2$@ SAAVUTUS";

/* Achievement User Title number of achievements.used when value is 0 */
"ACHIEVEMENT_N1_OF_M2_UPPERCASE_ZERO" = "%1$@ / %2$@ SAAVUTUSTA";

/* Achievement User Title number of achievements.used when value is 0 */
"ACHIEVEMENT_N1_OF_M2_ZERO" = "%1$@ / %2$@ saavutusta ";

/* Achievement detail when achievement hasn't been earned yet. */
"ACHIEVEMENT_NOT_YET_ACHIEVED" = "Ei vielä saavutettu";

/* Achievement 50% complete. */
"ACHIEVEMENT_PERCENT_COMPLETE" = "%1$@ suoritettu";

/* number of points for that achievement. Used for when value is >1 */
"ACHIEVEMENT_POINTS_PLURAL" = "%@ p.";

/* number of points for that achievement. Used for when value is equal to 1 */
"ACHIEVEMENT_POINTS_SINGULAR" = "%@ p.";

/* Achievement User Title points tally.used when value is equal >1 */
"ACHIEVEMENT_POINTS_TALLY_PLURAL" = "(%@ p.)";

/* Achievement User Title points tally.used when value is equal 1 */
"ACHIEVEMENT_POINTS_TALLY_SINGULAR" = "(%@ p.)";

/* Achievement User Title points tally.used when value is equal 0 */
"ACHIEVEMENT_POINTS_TALLY_ZERO" = "(%@ p.)";

/* Unit to accompany large points count. Used for when value is >1 */
"ACHIEVEMENT_POINTS_UNIT_PLURAL" = "p.";

/* Unit to accompany large points count. Used for when value is equal to 1 */
"ACHIEVEMENT_POINTS_UNIT_SINGULAR" = "p.";

/* Unit to accompany large points count. Used for when value is equal to 0 */
"ACHIEVEMENT_POINTS_UNIT_ZERO" = "p.";

/* number of points for that achievement. Used for when value is equal to 0 */
"ACHIEVEMENT_POINTS_ZERO" = "%@ p.";

/* Undo name for adding an address to a recipient field in the compose window */
"ADDRESS_ADDITION" = "Osoitteen lisäys";

/* Undo name for removing an address from a recipient field in the compose window */
"ADDRESS_DELETION" = "Osoitteen poisto";

/* You are not allowed to send friend requests on this device (alert text) */
"ADD_FRIENDS_RESTRICTED_TEXT" = "Et voi lähettää kaveripyyntöjä tällä laitteella";

/* Cannot send friend requests (alert title) */
"ADD_FRIENDS_RESTRICTED_TITLE" = "Kaveripyyntöjä ei voida lähettää";

/* Add Player Button */
"ADD_PLAYER_BUTTON" = "Lisää pelaaja";

/* Message for not authenticate alert */
"ALERT_MESSAGE_NOT_AUTHENTICATED" = "Pelaaja ei ole kirjautunut sisään";

/* Message for parental controls alert */
"ALERT_MESSAGE_PARENTALCONTROLSBLOCKED" = "Et voi käyttää Game Centeriä tälle laitteelle";

/* Message for multiplayer parental controls alert */
"ALERT_MESSAGE_PARENTALCONTROLSBLOCKED_MULTIPLAYER" = "Et voi pelata moninpelejä tällä laitteella";

/* Title for not auntenticated alert */
"ALERT_TITLE_NOT_AUTHENTICATED_MULTIPLAYER" = "Moninpelit eivät ole käytettävissä";

/* Title for parental controls alert */
"ALERT_TITLE_PARENTALCONTROLSBLOCKED" = "Game Center ei saatavilla";

/* Title for multiplayer parental controls alert */
"ALERT_TITLE_PARENTALCONTROLSBLOCKED_MULTIPLAYER" = "Moninpelit eivät ole käytettävissä";

/* Anonymous player nickname */
"ANONYMOUS_PLAYER_NICKNAME" = "Anonyymi";

/* Apple ID Password Alert Title */
"APPLE_ID_PASSWORD" = "Apple ID ‑salasana";

/* Auto-match wait time over n minutes (plural) */
"APPROX_WAIT_TIME_MINUTES_PLURAL" = "Game Center voi arpoa sinulle pelikaverin saatavilla olevista pelaajista. Pelikaverin keskim. arvonta-aika: yli %@ minuuttia";

/* Auto-match wait time over n minute (singular) */
"APPROX_WAIT_TIME_MINUTES_SINGULAR" = "Game Center voi arpoa sinulle pelikaverin saatavilla olevista pelaajista. Pelikaverin keskim. arvonta-aika: yli %@ minuutti";

/* Auto-match wait time over n minutes (zero) */
"APPROX_WAIT_TIME_MINUTES_ZERO" = "Game Center voi arpoa sinulle pelikaverin saatavilla olevista pelaajista. Pelikaverin keskim. arvonta-aika: yli %@ minuuttia";

/* Auto-match wait time n seconds (plural) */
"APPROX_WAIT_TIME_PLURAL" = "Game Center voi arpoa sinulle pelikaverin saatavilla olevista pelaajista. Pelikaverin keskim. arvonta-aika: %@ sekuntia";

/* Auto-match wait time n second (singular) */
"APPROX_WAIT_TIME_SINGULAR" = "Game Center voi arpoa sinulle pelikaverin saatavilla olevista pelaajista. Pelikaverin keskim. arvonta-aika: %@ sekunti";

/* Auto-match wait time n seconds (zero) */
"APPROX_WAIT_TIME_ZERO" = "Game Center voi arpoa sinulle pelikaverin saatavilla olevista pelaajista. Pelikaverin keskim. arvonta-aika: %@ sekuntia";

/* Go To App Store Invite Button Title */
"APP_STORE" = "App Store";

/* Auto-match */
"AUTO_MATCH" = "Arvo pelikaveri";

/* Auto-matched */
"AUTO_MATCHED" = "Arvottu pelikaveri";

/* Auto-Match player */
"AUTO_MATCH_PLAYER" = "Arvottu pelikaveri";

/* button to friend request */
"BUTTON_TO_SEND_FRIEND_REQUEST" = "Lähetä";

/* button to send game invite */
"BUTTON_TO_SEND_GAME_INVITE" = "Lähetä";

/* By Game Center */
"BY_GAME_CENTER" = "Game Center etsii";

/* Cancelled invite label */
"CANCELLED_INVITE_LABEL" = "Kumottu";

/* Cancel */
"CANCEL_BUTTON" = "Kumoa";

/* Can't Connect invite label */
"CANT_CONNECT_INVITE_LABEL" = "Ei voida yhdistää";

/* Can't connect to Game Center account pages message */
"CANT_CONNECT_TO_GAME_CENTER_ACCOUNT_PAGES_MESSAGE" = "Game Center ‑tilipalvelut eivät ole käytettävissä.\nYritä myöhemmin uudelleen.";

/* Cannot connect message */
"CAN_NOT_CONNECT_TO_GAME_CENTER_MESSAGE" = "Game Centerin käyttö vaatii yhteyden Wi-Fi- tai mobiilidataverkkoon";

/* Challenge Friend Picker's \"done\" button title for when coming from a message view  */
"CHALLENGE_ADD_PLAYERS_BUTTON_TITLE" = "Lisää";

/* Instructive text below disabled \"Send Challenge\" button when the player for the current score screen is not the local player's friend. %1$@ is the other player's name. */
"CHALLENGE_BUTTON_DISABLED_NOT_FRIEND" = "Ystävysty pelaajan %1$@ kanssa, jotta voit lähettää haasteen";

/* Instructive text below disabled \"Challenge Friends\" button when the current player has no friends */
"CHALLENGE_BUTTON_DISABLED_NO_FRIENDS" = "Hanki ystäviä Game Centerissä, jotta voit lähettää ja vastaanottaa haasteita.";

/* Instructive text below disabled \"Challenge Friends\" button when the current player's friends have all already earned the current achievement. %1$@ is the achievement's name */
"CHALLENGE_BUTTON_DISABLED_NO_FRIENDS_ELIGIBLE" = "Kaverisi ovat jo ansainneet saavutuksen %1$@. Haasta heidät yrittämään saavutusta, jota he eivät ole ansainneet.";

/* Instructive text below disabled \"Challenge Friends\" / \"Send Challenge\" button when the current player has no score for the current leaderboard. %1$@ is the leaderboard's name. */
"CHALLENGE_BUTTON_DISABLED_NO_SCORE" = "Hanki tulos tulostaulukossa %1$@ ja haasta kaverisi rikkomaan tuloksesi.";

/* Challenge Completed Alert Button OK Title */
"CHALLENGE_COMPLETED_OK_BUTTON" = "OK";

/* Challenges detail goal description for achievement challenge */
"CHALLENGE_DETAIL_ACHIEVEMENT_GOAL_FORMAT" = "Pelaajan %1$@ haaste: %2$@";

/* Challenges detail from line */
"CHALLENGE_DETAIL_FROM_FORMAT" = "Haaste pelaajalta %1$@";

/* Challenges detail goal description for any challenge */
"CHALLENGE_DETAIL_GOAL_FORMAT" = "Pelaajan %1$@ haaste:";

/* Challenges detail quote wrapper for message */
"CHALLENGE_DETAIL_MESSAGE_QUOTE_FORMAT" = "”%1$@”";

/* Challenges detail goal description for score challenge, for example \"Doc Brown's challenge: score 500 touchdowns on level 1\" */
"CHALLENGE_DETAIL_SCORE_GOAL_FORMAT" = "Pelaajan %1$@ haaste: %2$@ pistettä taulukossa %3$@";

/* Challenge Friend Title */
"CHALLENGE_FRIEND" = "Haasta kaveri";

/* Send Challenge Invitation Title */
"CHALLENGE_INVITATION_TITLE" = "Lähetä haaste";

/* Challenge invitation description start */
"CHALLENGE_INVITE_DESCRIPTION_START" = "Haaste:";

/* Challenges list description for player, without a message */
"CHALLENGE_LIST_FROM_PLAYER_NO_MESSAGE_FORMAT" = "Pelaajalta %1$@";

/* Challenges list description for player, with a message */
"CHALLENGE_LIST_FROM_PLAYER_WITH_MESSAGE_FORMAT" = "Pelaajalta %1$@:";

/* Challenges list description for player, without a message */
"CHALLENGE_LIST_PLAYER_NO_MESSAGE_FORMAT" = "%1$@";

/* Challenges list description for player, with a message */
"CHALLENGE_LIST_PLAYER_WITH_MESSAGE_FORMAT" = "%1$@: ";

/* Challenges list description for score challenge */
"CHALLENGE_LIST_SCORE_GOAL_FORMAT" = "Pisteet: %1$@ (%2$@)";

/* Challenge completed by current player banner message while in that game */
"CHALLENGE_LOCALLY_COMPLETED_BANNER_IN_GAME_FORMAT" = "Löit pelaajan %1$@ haasteen: %2$@";

/* Challenge Friend Picker Back Button Title */
"CHALLENGE_PICKER_BACK_TITLE" = "Takaisin";

/* Challenge Friend Picker Title */
"CHALLENGE_PICKER_TITLE" = "Valitse kaverit";

/* Close the challenge received alert without further action */
"CHALLENGE_RECEIVED_IGNORE" = "Hylkää";

/* Challenge received message in game with challenge goal text (i.e.: Challenged you: 1000 coins on Level 1) */
"CHALLENGE_RECEIVED_IN_GAME_BANNER_FORMAT" = "Haastoi sinut: %1$@";

/* Launch the game to start the challenge */
"CHALLENGE_RECEIVED_LAUNCH_GAME" = "Aloita peli";

/* There's no compatible game on the device -- launch the app store with the game's URL */
"CHALLENGE_RECEIVED_LAUNCH_STORE" = "Siirry App Storeen";

/* Challenge received message while not in that game with game title and goal (i.e.: Rescue Rangers Challenge: 1000 coins on Level 1 */
"CHALLENGE_RECEIVED_OUT_OF_GAME_BANNER_FORMAT" = "Haaste: %1$@ %2$@";

/* Challenge completed by other player banner message while in that game */
"CHALLENGE_REMOTELY_COMPLETED_BANNER_IN_GAME_FORMAT" = "Löi haasteesi: %1$@";

/* Challenge completed by other player banner message while not in that game */
"CHALLENGE_REMOTELY_COMPLETED_BANNER_OUT_OF_GAME_FORMAT" = "Löi haasteesi pelissä %1$@: %2$@";

/* Change */
"CHANGE" = "Muuta";

/* Close Friend Request Alert Button Title */
"CLOSE_FRIEND_REQUEST_ALERT_BUTTON_TITLE" = "Sulje";

/* Close Turn Based Alert Button Title */
"CLOSE_TURN_BASED_ALERT_BUTTON_TITLE" = "Sulje";

/* Format string used for '30 Achievements' */
"COMPARE_N_ACHIEVEMENTS_HEADER_PLURAL" = "%1$@ saavutusta";

/* Format string used for '1 Achievement' */
"COMPARE_N_ACHIEVEMENTS_HEADER_SINGULAR" = "%1$@ saavutus";

/* Format string used for 'No Achievements' */
"COMPARE_N_ACHIEVEMENTS_HEADER_ZERO" = "Ei saavutuksia";

/* Connecting invite label */
"CONNECTING_INVITE_LABEL" = "Yhdistetään";

/* Connection failed alert message */
"CONNECTION_FAILED_ALERT_MESSAGE" = "Game Center -palvelimelle ei voitu yhdistää.";

/* Create New Apple ID Button */
"CREATE_NEW_ACCOUNT" = "Luo uusi Apple ID";

/* Declined invite label */
"DECLINED_INVITE_LABEL" = "Kieltäytyi";

/* Decline Invite Button Title */
"DECLINE_INVITE_BUTTON_TITLE" = "Kieltäydy";

/* Default game invitation message */
"DEFAULT_GAME_INVITATION_MESSAGE_FORMAT" = "%@: haluatko pelata?";

/* Challenge button title for when displaying non-local player's score or achievement detail screen */
"DETAIL_SCREEN_CHALLENGE_BUTTON_TITLE_FROM_OTHER" = "Lähetä haaste";

/* Challenge button title for when displaying local player's own score or achievement detail screen */
"DETAIL_SCREEN_CHALLENGE_BUTTON_TITLE_FROM_OWN" = "Haasta kavereita";

/* Share button title for when displaying score or achievement detail screen */
"DETAIL_SCREEN_SHARE_BUTTON_TITLE" = "Jaa";

/* Disable Button */
"DISABLE_BUTTON" = "Poista";

/* Disconnected invite label */
"DISCONNECTED_INVITE_LABEL" = "Yhteys katkaistu";

/* Button title used to dismiss a friend or game recommendation */
"DISMISS_CONFIRMATION_BUTTON_TITLE" = "Poista";

/* Done button title */
"DONE_BUTTON_TITLE" = "Valmis";

/* button to send friend request */
"DONT_SEND" = "Älä lähetä";

/* title for 'buy game' button in game detail view when the game is downloading */
"DOWNLOADING_BUTTON_TITLE" = "Asennetaan…";

/* Ellipsis for truncation at end of string */
"ELLIPSIS_FOR_TRUNCATION" = "…";

/* challenge invite message field placeholder text */
"ENTER_OPTIONAL_MESSAGE" = "Syötä oma viestisi…";

/* GKErrorAuthenticationInProgress description */
"ERROR_AUTHENTICATIONINPROGRESS_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska paikallista pelaajaa todennetaan jo.";

/* GKErrorCancelled description */
"ERROR_CANCELLED_DESCRIPTION" = "Pyydetty toiminto kumottiin.";

/* GKErrorCommunicationsFailure description */
"ERROR_COMMUNICATIONSFAILURE_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun johtuen virheestä palvelinyhteydessä.";

/* GKErrorGameUnrecognized description */
"ERROR_GAMEUNRECOGNIZED_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska Game Center ei tunnista ohjelmaa.";

/* GKErrorInvalidCredentials description */
"ERROR_INVALIDCREDENTIALS_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska käyttäjätunnus ja/tai salasana ovat virheellisiä.";

/* GKErrorInvalidParameter description */
"ERROR_INVALIDPARAMETER_DESCRIPTION" = "Pyydettyjä toimintoja ei voitu suorittaa loppuun, koska yksi tai useampi parametri on virheellinen.";

/* GKErrorInvalidPlayer description */
"ERROR_INVALIDPLAYER_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska pelaaja on virheellinen.";

/* GKErrorIssueChallengeDenied description */
"ERROR_INVALID_CHALLENGE" = "Haastepyyntö epäonnistui virheellisen haastedatan vuoksi.";

/* GKErrorMatchRequestInvalid description */
"ERROR_MATCHREQUESTINVALID_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska pelipyyntö on virheellinen.";

/* GKErrorNotAuthenticated description */
"ERROR_NOTAUTHENTICATED_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska paikallista pelaajaa ei ole todennettu.";

/* GKErrorParentalControlsBlocked description */
"ERROR_PARENTALCONTROLSBLOCKED_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska tämä toiminto on estetty Rajoituksissa.";

/* GKErrorScoreNotSet description */
"ERROR_SCORENOTSET_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska pistearvoa ei ole asetettu.";

/* GKErrorTurnBasedInvalidParticipant description */
"ERROR_TBG_INVALID_PARTICIPANT" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska määritetty osallistuja on virheellinen.";

/* GKErrorTurnBasedInvalidState description */
"ERROR_TBG_INVALID_STATE" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska istunnon tila on virheellinen.";

/* GKErrorTurnBasedInvalidTurn description */
"ERROR_TBG_INVALID_TURN" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska määritetyllä osallistujalla ei ole vaadittua vuorotilaa.";

/* GKErrorTurnBasedMatchDataTooLarge description */
"ERROR_TBG_MATCH_DATA_TO_LARGE" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska pelidata oli liian suuri.";

/* GKErrorTurnBasedTooManySessions description */
"ERROR_TBG_TOO_MANY_SESSIONS" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska se ylittäisi istuntojen enimmäismäärän.";

/* GKErrorUnderage description */
"ERROR_UNDERAGE_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska toiminto ei ole alaikäisten pelaajien käytettävissä.";

/* GKErrorUnexpectedConnection description */
"ERROR_UNEXPECTEDCONNECTION_DESCRIPTION" = "Odottamaton pelaaja liittyi peliin.";

/* GKErrorUnknown description */
"ERROR_UNKNOWN_DESCRIPTION" = "Toimintoa ei voitu suorittaa loppuun, koska tapahtui tuntematon virhe.";

/* GKErrorUserDenied description */
"ERROR_USERDENIED_DESCRIPTION" = "Pyydettyä toimintoa ei voitu suorittaa loppuun, koska käyttäjä kielsi sen.";

/* Extra recipients */
"EXTRA_RECIPIENTS_FORMAT" = " ja %@ lisää…";

/* Facebook like label format for plural likes */
"FACEBOOK_LABEL_PLURAL" = "%@ kaveria tykkää tästä";

/* Facebook like label format for singular likes */
"FACEBOOK_LABEL_SINGULAR" = "%@ kaveri tykkää tästä";

/* Message to show when liking via facebook is unavailable due to network connectivity issues or errors */
"FACEBOOK_LABEL_UNAVAILABLE" = "Facebook-tykkäys ei käytössä";

/* Facebook like label format for zero likes */
"FACEBOOK_LABEL_ZERO" = "%@ kaveria tykkää tästä";

/* Label for Facebook like button when player hasn't liked game */
"FACEBOOK_LIKE_NORMAL_LABEL" = "Tykkää";

/* Label for Facebook like button when player likes the game */
"FACEBOOK_LIKE_SELECTED_LABEL" = "Tykkää";

/* Failed invite label */
"FAILED_INVITE_LABEL" = "Epäonnistui";

/* friend text in compare achievement screen */
"FRIEND" = "Kaveri";

/* Format string used for '<n> friends' when showing local player in friends list */
"FRIENDS_IN_COMMON_ME_PLURAL" = "%@ kaveria";

/* Format string used for '<n> friend' when showing local player in friends list */
"FRIENDS_IN_COMMON_ME_SINGULAR" = "%@ kaveri";

/* Format string used for 'No friends' when showing local player in friends list */
"FRIENDS_IN_COMMON_ME_ZERO" = "Ei kavereita";

/* Format string used for '<n> friends in common' */
"FRIENDS_IN_COMMON_PLURAL" = "%@ yhteistä kaveria";

/* Format string used for '1 friend in common' */
"FRIENDS_IN_COMMON_SINGULAR" = "%@ yhteinen kaveri";

/* Format string used for 'No friends in common' */
"FRIENDS_IN_COMMON_ZERO" = "Ei yhteisiä kavereita";

/* Friends-only player scope header (plural) */
"FRIENDS_ONLY_PLAYER_SCOPE_HEADER_PLURAL" = "%@ kaveria";

/* Friends-only player scope header (singular) */
"FRIENDS_ONLY_PLAYER_SCOPE_HEADER_SINGULAR" = "%@ kaveri";

/* Friends-only player scope header (plural, uppercase) */
"FRIENDS_ONLY_PLAYER_SCOPE_HEADER_UPPERCASE_PLURAL" = "%@ KAVERIA";

/* Friends-only player scope header (singular, uppercase) */
"FRIENDS_ONLY_PLAYER_SCOPE_HEADER_UPPERCASE_SINGULAR" = "%@ KAVERI";

/* Friends-only player scope header (zero, uppercase) */
"FRIENDS_ONLY_PLAYER_SCOPE_HEADER_UPPERCASE_ZERO" = "KAVERIT";

/* Friends-only player scope header (zero) */
"FRIENDS_ONLY_PLAYER_SCOPE_HEADER_ZERO" = "Kaverit";

/* Friend request accepted format - 1:nickname (2:firstName 3:lastName) */
"FRIEND_ACCEPTANCE_ALIAS_1_FIRST_2_LAST_3_FORMAT" = "%1$@ (%2$@ %3$@) on hyväksynyt kaveripyyntösi.";

/* Friend request accepted format - 1:nickname (2:either firstName or lastName -- the user didn't fill in the other name) */
"FRIEND_ACCEPTANCE_ALIAS_1_NAME_2_FORMAT" = "%1$@ (%2$@) on hyväksynyt kaveripyyntösi.";

/* Friend request accepted format (either single string from the server, for older servers, or just the nickname if first and last are unavailable) */
"FRIEND_ACCEPTANCE_FORMAT" = "%1$@ on hyväksynyt kaveripyyntösi.";

/* Friend picker Finding Players */
"FRIEND_PICKER_FINDING_PLAYERS" = "Etsitään pelaajia";

/* Game invites disabled player status text */
"FRIEND_PICKER_GAME_INVITES_DISABLED" = "Ei hyväksy pelikutsuja";

/* Section header title for players that have already earned an achievement */
"FRIEND_PICKER_HEADER_TITLE_ALREADY_EARNED" = "Kaverit, joilla on tämä saavutus";

/* Section header title for players that have already earned an achievement (plural) */
"FRIEND_PICKER_HEADER_TITLE_ALREADY_EARNED_PLURAL" = "%@ kaveria, joilla on tämä saavutus";

/* Section header title for players that have already earned an achievement (singular) */
"FRIEND_PICKER_HEADER_TITLE_ALREADY_EARNED_SINGULAR" = "%@ kaveri, jolla on tämä saavutus";

/* Section header title for players that have already earned an achievement (zero) */
"FRIEND_PICKER_HEADER_TITLE_ALREADY_EARNED_ZERO" = "Yhdelläkään kaverilla ei ole tätä saavutusta";

/* Friends section header title */
"FRIEND_PICKER_HEADER_TITLE_FRIEND" = "Kaverit";

/* Friends section header title format (plural) */
"FRIEND_PICKER_HEADER_TITLE_FRIEND_PLURAL" = "%@ kaveria";

/* Friends section header title (singular) */
"FRIEND_PICKER_HEADER_TITLE_FRIEND_SINGULAR" = "%@ kaveri";

/* Friends section header title format (zero) */
"FRIEND_PICKER_HEADER_TITLE_FRIEND_ZERO" = "%@ kaveria";

/* Doesn't Play This Game section header title */
"FRIEND_PICKER_HEADER_TITLE_NOT_YET_PLAYED" = "Kaverit, jotka eivät ole pelanneet";

/* Doesn't Play This Game section header title (plural) */
"FRIEND_PICKER_HEADER_TITLE_NOT_YET_PLAYED_PLURAL" = "%@ kaveria, jotka eivät ole pelanneet";

/* Doesn't Play This Game section header title (singular) */
"FRIEND_PICKER_HEADER_TITLE_NOT_YET_PLAYED_SINGULAR" = "%@ kaveri, joka ei ole pelannut";

/* Doesn't Play This Game section header title (zero) */
"FRIEND_PICKER_HEADER_TITLE_NOT_YET_PLAYED_ZERO" = "Kaikki kaverit ovat pelanneet";

/* Play This Game section header title */
"FRIEND_PICKER_HEADER_TITLE_PLAYED_THIS_GAME" = "Kaverit, jotka pelaavat tätä peliä";

/* Play This Game section header title (plural) */
"FRIEND_PICKER_HEADER_TITLE_PLAYED_THIS_GAME_PLURAL" = "%@ kaveria, jotka pelaavat tätä peliä";

/* Play This Game section header title (singular) */
"FRIEND_PICKER_HEADER_TITLE_PLAYED_THIS_GAME_SINGULAR" = "%@ kaveri, joka pelaa tätä peliä";

/* Play This Game section header title (zero) */
"FRIEND_PICKER_HEADER_TITLE_PLAYED_THIS_GAME_ZERO" = "Yksikään kaveri ei pelaa tätä peliä";

/* Players section header title */
"FRIEND_PICKER_HEADER_TITLE_PLAYER" = "Pelaajat";

/* Players section header title format (plural) */
"FRIEND_PICKER_HEADER_TITLE_PLAYER_PLURAL" = "%@ pelaajaa";

/* Players section header title (singular) */
"FRIEND_PICKER_HEADER_TITLE_PLAYER_SINGULAR" = "%@ pelaaja";

/* Players section header title format (zero) */
"FRIEND_PICKER_HEADER_TITLE_PLAYER_ZERO" = "%@ pelaajaa";

/* Friend picker Not Online */
"FRIEND_PICKER_NOT_ONLINE" = "Ei linjoilla";

/* Friend picker scope title for showing all friends */
"FRIEND_PICKER_SCOPE_TITLE_ALL" = "KAIKKI";

/* Friend picker scope title for showing nearby players */
"FRIEND_PICKER_SCOPE_TITLE_NEARBY" = "LÄHIPELAAJAT";

/* Friend picker scope title for showing recent friends */
"FRIEND_PICKER_SCOPE_TITLE_RECENT" = "ÄSKEISET";

/* Friend request composition window back button */
"FRIEND_REQUEST" = "Kaveripyyntö";

/* friend request alert message */
"FRIEND_REQUEST_ALERT_MESSAGE_FORMAT" = "Haluatko lähettää kaveripyynnön pelaajalle %@?";

/* Friend Request alert title */
"FRIEND_REQUEST_ALERT_TITLE" = "Kaveripyyntö";

/* Friend request notification title. */
"FRIEND_REQUEST_NOTIFICATION_TITLE_FORMAT" = "Kaveripyyntö pelaajalta %1$@";

/* Format string used for '<n> games' for local player in friends list */
"GAMES_IN_COMMON_ME_PLURAL" = "%@ peliä";

/* Format string used for '1 game' for local player in friends list */
"GAMES_IN_COMMON_ME_SINGULAR" = "%@ peli";

/* Format string used for 'No games' for local player in friends list */
"GAMES_IN_COMMON_ME_ZERO" = "Ei pelejä";

/* Format string used for '<n> games in common' */
"GAMES_IN_COMMON_PLURAL" = "%@ yhteistä peliä";

/* Format string used for '1 game in common' */
"GAMES_IN_COMMON_SINGULAR" = "%@ yhteinen peli";

/* Format string used for 'No games in common' */
"GAMES_IN_COMMON_ZERO" = "Ei yhteisiä pelejä";

/* Game Cancelled Alert Header */
"GAME_CANCELLED_ALERT_HEADER" = "Peli kumottu";

/* Warning alert for storedemo */
"GAME_CENTER_ACCOUNT_LOCKED" = "Ominaisuus ei käytössä";

/* Default title text for alerts */
"GAME_CENTER_ALERT_TITLE" = "Game Center";

/* alert title */
"GAME_CENTER_DEMO_MODE" = "Esittelytila";

/* Game Center Disabled alert title */
"GAME_CENTER_DISABLED" = "Poistetaanko Game Center käytöstä?";

/* Game Center Disabled alert message */
"GAME_CENTER_DISABLED_ALERT_MESSAGE" = "Voit ottaa Game Centerin käyttöön milloin tahansa kirjautumalla Game Center -ohjelmaan.";

/* GAME CENTER header text */
"GAME_CENTER_HEADER_TEXT" = "GAME CENTER";

/* GKErrorNotSupported description */
"GAME_CENTER_IS_NOT_SUPPORTED" = "Game Centeriä ei tueta.";

/* A game that you have never played */
"GAME_DETAIL_NEVER_PLAYED" = "Ei koskaan pelattu";

/* Game Invite Alert Header With Alias and Game name */
"GAME_INVITE_ALERT_HEADER_ALIAS_1_GAME_NAME_2_FORMAT" = "%1$@ kutsuu pelaamaan peliä %2$@";

/* Game Invite Alert Header With Alias only */
"GAME_INVITE_ALERT_HEADER_ALIAS_ONLY_FORMAT" = "Kutsu pelaajalta %1$@";

/* Game Invite Cancelled Alert Header With Alias */
"GAME_INVITE_CANCELLED_ALERT_HEADER_ALIAS_FORMAT" = "Kutsu pelaajalta %@ kumottiin.";

/* Game Invite failed due to not finding mininum number of players  */
"GAME_INVITE_UNABLE_TO_FIND_MIN_PLAYERS" = "Arvo pelikaveri -toiminto ei löytänyt riittävästi pelaajia. Kutsu lisää pelaajia.";

/* Not Enough Players */
"GAME_INVITE_UNABLE_TO_FIND_MIN_PLAYERS_TITLE" = "Ei riittävästi pelaajia";

/* Game not recognized alert title */
"GAME_NOT_RECOGNIZED_ALERT_TITLE" = "Game Center ei tunnista tätä peliä.";

/* Game rating failed because the user was not logged into Game Center with an account used to purchase the game. */
"GAME_RATING_INVALID_CREDENTIALS" = "Pelin arviointi edellyttää, että kirjaudut sisään samalla Apple ID:llä, jolla ostit pelin.";

/* Game rating not sent alert title */
"GAME_RATING_NOT_SENT" = "Peliarviota ei lähetetty";

/* Game Reconnect Message */
"GAME_RECONNECT_MESSAGE" = "Yhdistetäänkö uudelleen?";

/* GKMatchmakerViewController Title */
"GKMATCHMAKERVIEWCONTROLLER_TITLE" = "Moninpeli";

/* Global player scope header (plural) */
"GLOBAL_PLAYER_SCOPE_HEADER_PLURAL" = "Kaikki %@ pelaajaa";

/* Global player scope header (singular */
"GLOBAL_PLAYER_SCOPE_HEADER_SINGULAR" = "Kaikki pelaajat";

/* Global player scope header (plural, uppercase) */
"GLOBAL_PLAYER_SCOPE_HEADER_UPPERCASE_PLURAL" = "KAIKKI %@ PELAAJAA";

/* Global player scope header (singular, uppercase) */
"GLOBAL_PLAYER_SCOPE_HEADER_UPPERCASE_SINGULAR" = "KAIKKI PELAAJAT";

/* Global player scope header (zero, uppercase) */
"GLOBAL_PLAYER_SCOPE_HEADER_UPPERCASE_ZERO" = "KAIKKI PELAAJAT";

/* Global player scope header (zero) */
"GLOBAL_PLAYER_SCOPE_HEADER_ZERO" = "Kaikki pelaajat";

/* achievement title in compare achievement screen for hidden achievement (iphone version) */
"HIDDEN" = "Kätketty";

/* Forgot your Apple ID or password? URL title */
"IFORGOT_LINK_TITLE" = "Unohditko Apple ID:n tai salasanan?";

/* Import Friends Title */
"IMPORT_FRIENDS_TITLE" = "Tuo kavereita";

/* Incompatible invite label */
"INCOMPATIBLE_INVITE_LABEL" = "Eri peliversio";

/* Incorrect Password alert message */
"INCORRECT_PASSWORD_ALERT_MESSAGE" = "Salasana on syötetty väärin liian monta kertaa. Jos olet unohtanut salasanasi, muuta se koskettamalla Nollaa.";

/* Incorrect Password alert title */
"INCORRECT_PASSWORD_ALERT_TITLE" = "Väärä salasana";

/* Game Invite Cancelled Alert Header Without Alias */
"INVITATION_CANCELLED" = "Kutsu kumottiin";

/* Invitation Title */
"INVITATION_TITLE" = "Kutsu";

/* Invited invite label */
"INVITED_INVITE_LABEL" = "Odotetaan…";

/* Invitee Accepted Alert Header */
"INVITEE_ACCEPTED_ALERT_HEADER" = "Pelaaja on hyväksynyt kutsusi.";

/* Invitee Accepted Alert Header With Alias and Game name */
"INVITEE_ACCEPTED_ALERT_HEADER_ALIAS_1_GAMENAME_2_FORMAT" = "%1$@ on hyväksynyt kutsun peliin %2$@.";

/* Invitee Accepted Alert Header With Alias only */
"INVITEE_ACCEPTED_ALERT_HEADER_ALIAS_ONLY_FORMAT" = "%@ on hyväksynyt kutsun.";

/* Invitee Accepted Alert Header With Game name only */
"INVITEE_ACCEPTED_ALERT_HEADER_GAME_NAME_ONLY_FORMAT" = "Pelaaja on hyväksynyt kutsusi peliin %@.";

/* Invitee Declined Alert Header */
"INVITEE_DECLINED_ALERT_HEADER" = "Pelaaja on kieltäytynyt kutsustasi.";

/* Rank among friends format plural */
"INVITE_ALERT_HEADER_ALIAS_1_GAME_NAME_2_PLURAL" = "%1$@. (kavereita %2$@)";

/* Rank among friends format singular */
"INVITE_ALERT_HEADER_ALIAS_1_GAME_NAME_2_SINGULAR" = "%1$@. (kavereita %2$@)";

/* Invite button description (plural) */
"INVITE_BUTTON_DESCRIPTION_PLURAL" = "Kutsu jopa %d pelaajaa lisää Game Center -kaveriluettelosta";

/* Invite button description (singular) */
"INVITE_BUTTON_DESCRIPTION_SINGULAR" = "Kutsu yksi pelaaja lisää Game Center -kaveriluettelosta";

/* Invite button description (zero) */
"INVITE_BUTTON_DESCRIPTION_ZERO" = "-";

/* Challenge friends picker view's title bar for when picking friends to send a challenge to */
"INVITE_CHALLENGE_FRIENDS" = "Haasta kavereita";

/* Invite Friend */
"INVITE_FRIEND" = "Kutsu kaveri";

/* Invite Friends Title */
"INVITE_FRIENDS_TITLE" = "Kutsu kavereita";

/* Invite Players Button Title */
"INVITE_PLAYERS_BUTTON_TITLE" = "Kutsu pelaajia";

/* Invite up to n players format string (plural) */
"INVITE_UP_TO_N_PLAYERS_PLURAL" = "Kutsu enintään %@";

/* Invite up to 1 player format string (singular) */
"INVITE_UP_TO_N_PLAYERS_SINGULAR" = "Kutsu enintään %@";

/* Invite up to n players format string (zero) */
"INVITE_UP_TO_N_PLAYERS_ZERO" = "Kutsu enintään %@";

/* Just played: <game> format string */
"JUST_PLAYED_LAST_PLAYED_GAME_FORMAT" = "Juuri pelattu: %@";

/* Last matched on date format */
"LAST_MATCHED_ON_DATE_FORMAT" = "Pelattu viimeksi: %1$@";

/* Last played: <game> format string */
"LAST_PLAYED_GAME_FORMAT" = "Viime peli: %@";

/* Last Played <date> label */
"LAST_PLAYED_LABEL" = "Viime peli";

/* Last played on date format */
"LAST_PLAYED_ON_DATE_FORMAT" = "Viime peli: %1$@";

/* Launch App Button Title */
"LAUNCH_APP_BUTTON_TITLE" = "Käynnistä ohjelma";

/* Leaderboards controller title */
"LEADERBOARDS_CONTROLLER_TITLE" = "Tulostaulukot";

/* Leaderboard categories (plural) */
"LEADERBOARD_CATEGORIES_PLURAL" = "%@ tulostaulukkoa";

/* Leaderboard categories (singular) */
"LEADERBOARD_CATEGORIES_SINGULAR" = "%@ tulostaulukko";

/* Leaderboard categories (zero) */
"LEADERBOARD_CATEGORIES_ZERO" = "%@ tulostaulukkoa";

/* Leaderboard sheet title */
"LEADERBOARD_DEFAULT_TITLE" = "Tulostaulukko";

/* leaderboard range limits execption string */
"LEADERBOARD_RANGE_LIMITS_EXECPTION" = "Tulostaulukon alueella {%d,%d} tulee olla sijainti >= %d ja alue <= %d";

/* Loading… status text */
"LOADING_STATUS" = "Ladataan…";

/* Login Button */
"LOGIN_BUTTON" = "Kirjaudu sisään";

/* Matchmaker Connecting */
"MATCHMAKER_CONNECTING_TO_PLAYERS" = "Yhdistetään…";

/* Matchmaker Finding Players */
"MATCHMAKER_FINDING_PLAYERS" = "Etsitään pelaajia…";

/* Matchmaker Invite Friends */
"MATCHMAKER_INVITE_FRIENDS" = "Kutsu kavereita";

/* Matchmaker Inviting Players */
"MATCHMAKER_INVITING_PLAYERS" = "Kutsutaan pelaajia";

/* Matchmaker Play Now */
"MATCHMAKER_PLAY_NOW" = "Pelaa nyt";

/* Matchmaker Starting Game */
"MATCHMAKER_STARTING_GAME" = "Aloitetaan peliä…";

/* Matchmaker Waiting for game to start */
"MATCHMAKER_WAITING_TO_START" = "Odotetaan…";

/* Me */
"ME" = "Minä";

/* Me */
"ME_TEXT_IN_COMPARE_ACHIEVEMENT_SCREEN" = "Minä";

/* multiplayer player range singular */
"MULTIPLAYER_PLAYER_RANGE" = "%1$@ - %2$@ pelaajaa";

/* multiplayer player range singular */
"MULTIPLAYER_PLAYER_RANGE_SINGULAR" = "%@ pelaajaa";

/* <identifiable name> <quoted alias> */
"NAME_FIRST_1_LAST_2_FORMAT" = "%1$@ %2$@";

/* Label next to switch for turning on/off nearby multiplayer */
"NEARBY_PLAYERS" = "Lähipelaajat";

/* Message explaining nearby multiplayer underneath the on/off switch */
"NEARBY_PLAYERS_MESSAGE" = "Salli Game Center -lähipelaajien etsiä sinua ja kutsua sinut moninpeleihin Wi-Fiä tai Bluetoothia käyttäen.";

/* Never Played */
"NEVER_PLAYED" = "Ei koskaan pelattu";

/* Never played string for cell line 1 in category list */
"NEVER_PLAYED_CATEGORY_LIST" = "Ei koskaan pelattu";

/* Next */
"NEXT" = "Seuraava";

/* now (time) */
"NOW_TIME" = "nyt";

/* No Achievements */
"NO_ACHIEVEMENTS" = "Ei saavutuksia";

/* No achievements details string */
"NO_ACHIEVEMENTS_DETAILS" = "Ei saavutuksia";

/* No Answer invite label */
"NO_ANSWER_INVITE_LABEL" = "Ei vastaa";

/* No Friends message */
"NO_FRIENDS_MESSAGE" = "Ei kavereita";

/* No Friend Scores (uppercase) */
"NO_FRIEND_SCORES_UPPERCASE" = "KAVEREILLA EI PISTEITÄ";

/* No leaderboard details string */
"NO_LEADERBOARD_DETAILS" = "Ei tulostaulukkoa";

/* No leaderboard details string */
"NO_LEADERBOARD_OR_ACHIEVEMENT_DETAILS" = "Ei tulostaulukkoa tai saavutuksia";

/* No network alert message */
"NO_NETWORK_ALERT_MESSAGE" = "Yritä uudelleen, kun olet verkkoyhteydessä.";

/* No network alert title */
"NO_NETWORK_ALERT_TITLE" = "Verkko ei käytettävissä";

/* No score - player rank is zero */
"NO_SCORE" = "Ei tulosta";

/* No Scores */
"NO_SCORES" = "Ei pisteitä";

/* No Scores (uppercase) */
"NO_SCORES_UPPERCASE" = "EI PISTEITÄ";

/* No Status placeholder string */
"NO_STATUS_PLACEHOLDER" = "Ei tilaa";

/* OK Button */
"OK_BUTTON" = "OK";

/* Overall leaderboard navigation bar title */
"OVERALL_LEADERBOARD_CATEGORY_TITLE" = "Yhteistulos";

/* Parenthesized format string - typically used for (Bottom 10%) */
"PARENTHETICAL_FORMAT" = "(%1$@)";

/* Password incorrect alert message */
"PASSWORD_INCORRECT_ALERT_MESSAGE" = "Syöttämääsi Apple ID:tä ei löytynyt tai salasana on virheellinen. Yritä uudelleen.";

/* Password Placeholder */
"PASSWORD_PLACEHOLDER" = "Salasana";

/* Sandbox Password Placeholder */
"PASSWORD_PLACEHOLDER_SANDBOX" = "Sandbox Password";

/* Bottom x% format string */
"PERCENT_BOTTOM_FORMAT" = "alin %@";

/* Top x% format string */
"PERCENT_TOP_FORMAT" = "ylin %@";

/* Played Today: <game> format string */
"PLAYED_TODAY_LAST_PLAYED_GAME_FORMAT" = "Pelattu tänään: %@";

/* n or n+1 Players format string */
"PLAYERS_N1_OR_N_PLUS_ONE_2_FORMAT" = "%1$@ tai %2$@ pelaajaa";

/* n to n+x Players format string */
"PLAYERS_N1_TO_M2_FORMAT" = "%1$@ - %2$@ pelaajaa";

/* n Players */
"PLAYER_COUNT_PLURAL" = "%@ pelaajaa";

/* 1 Player */
"PLAYER_COUNT_SINGULAR" = "%@ pelaaja";

/* A friend who has never played a game  */
"PLAYER_DETAIL_NEVER_PLAYED" = "Ei koskaan pelattu";

/* Player disconnected format string */
"PLAYER_DISCONNECTED_FORMAT" = "%@ katkaisi yhteyden.";

/* Play button title */
"PLAY_BUTTON_TITLE" = "Pelaa";

/* Play Game button title */
"PLAY_GAME_BUTTON_TITLE" = "Pelaa peliä";

/* Play now button description (plural) */
"PLAY_NOW_BUTTON_DESCRIPTION_PLURAL" = "Pelaa nyt ja Game Center etsii sinulle jopa %d pelikaveria lisää.";

/* Play now button description (singular) */
"PLAY_NOW_BUTTON_DESCRIPTION_SINGULAR" = "Pelaa nyt ja Game Center etsii sinulle yhden pelikaverin lisää";

/* Play now button description (zero) */
"PLAY_NOW_BUTTON_DESCRIPTION_ZERO" = "Pelaa nyt ja Game Center ottaa pelin käyttöön sinulle ja valituille pelaajille.";

/* Play Now Button Title */
"PLAY_NOW_BUTTON_TITLE" = "Pelaa nyt";

/* Profile blacklisted alert message */
"PROFILE_BLACKLISTED_ALERT_MESSAGE" = "Syöttämäsi Apple ID on poistettu käytöstä. Ota yhteyttä asiakastukeen.";

/* quotes surrounding nicknames as displayed within lists (such as leaderboards) -- prefixed with directional marker */
"QUOTED_ALIAS_FORMAT" = "‎”%@”";

/* string within quotes for invite messages */
"QUOTED_MESSAGE_FORMAT" = "‎”%@”";

/* Ranked about the same as me */
"RANKED_ABOUT_SAME_AS_ME" = "Lähellä omaa tasoani";

/* Ranked higher than me */
"RANKED_HIGHER_THAN_ME" = "Minua ylempänä";

/* Ranked lower than me */
"RANKED_LOWER_THAN_ME" = "Minua alempana";

/* Rank and leaderboard size (plural) */
"RANK_1_LEADERBOARD_SIZE_2_PLURAL" = "%1$@. (pelaajia %2$@)";

/* Rank and leaderboard size (singular) */
"RANK_1_LEADERBOARD_SIZE_2_SINGULAR" = "%1$@. (pelaajia %2$@)";

/* #rank of max scores format */
"RANK_1_OF_MAX_SCORES_2_FORMAT" = "Sijalla %1$@ / %2$@";

/* <rank> (<Top/Bottom x%>) format string */
"RANK_1_TOP_BOTTOM_2_FORMAT" = "%1$@ (%2$@)";

/* Rank formatting string */
"RANK_FORMAT" = "%@";

/* Not ranked string for cell line 3 */
"RANK_NONE" = "Ei sijoitusta";

/* #<rank> format string */
"RANK_WITH_SYMBOL_FORMAT" = "Sija %@";

/* Ratings (plural) string */
"RATINGS_COUNT_PLURAL" = "%@ arviointia";

/* Ratings (singular) string */
"RATINGS_COUNT_SINGULAR" = "%@ arviointi";

/* Ratings (zero) string */
"RATINGS_COUNT_ZERO" = "Ei arviointeja";

/* Ready invite label */
"READY_INVITE_LABEL" = "Valmiina";

/* N recipients */
"RECIPIENT_COUNT_PLURAL" = "%@ vastaanottajaa";

/* 1 recipient */
"RECIPIENT_COUNT_SINGULAR" = "%@ vastaanottaja";

/* recipient seperator in inactive compose field */
"RECIPIENT_SEPERATOR_IN_INACTIVE_COMPOSE_FIELD" = ", ";

/* relative hours ago (plural) */
"RELATIVE_HOURS_AGO_PLURAL" = "%@ tuntia sitten";

/* relative hours ago (singular) */
"RELATIVE_HOURS_AGO_SINGULAR" = "%@ tunti sitten";

/* relative minutes ago (plural) */
"RELATIVE_MINUTES_AGO_PLURAL" = "%@ minuuttia sitten";

/* relative minutes ago (singular) */
"RELATIVE_MINUTES_AGO_SINGULAR" = "%@ minuutti sitten";

/* relative seconds ago (plural) */
"RELATIVE_SECONDS_AGO_PLURAL" = "%@ sekuntia sitten";

/* Remove */
"REMOVE_BUTTON_TITLE" = "Poista";

/* Remove Player Button */
"REMOVE_PLAYER_BUTTON" = "Poista pelaaja";

/* Report a Problem Title */
"REPORT_PROBLEM" = "Raportoi ongelma";

/* Reset Button */
"RESET_BUTTON" = "Nollaa";

/* <score> (<Top/Bottom x%>) format string */
"SCORE_1_TOP_BOTTOM_2_FORMAT" = "%1$@ (%2$@)";

/* goal text for score challenge alert, i.e. '1000 gold pieces on Level 1' */
"SCORE_CHALLENGE_RECEIVED_ALERT_GOAL_FORMAT" = "%1$@ tulostaulukossa %2$@";

/* Search results format string (plural) */
"SEARCH_RESULTS_PLURAL" = "%@ tulosta";

/* Search results format string (singular) */
"SEARCH_RESULTS_SINGULAR" = "1 tulos";

/* Search results format string (zero) */
"SEARCH_RESULTS_ZERO" = "Ei tuloksia";

/* Send Friend Request alert title */
"SEND_FRIEND_REQUEST" = "Lähetä kaveripyyntö";

/* Settings Button */
"SETTINGS_BUTTON" = "Asetukset";

/* HTML formatted email body for sharing an achievement earned by the local player */
"SHARE_ACHIEVEMENT_EMAIL_LOCAL_PLAYER_BODY" = "<html><p>Ansaitsin saavutuksen <a href=\"%3$@\">%1$@ pelissä %2$@</a>.</p></html>";

/* HTML formatted email body for sharing an achievement earned by another player */
"SHARE_ACHIEVEMENT_EMAIL_OTHER_PLAYER_BODY" = "<html><p>%1$@ ansaitsi saavutuksen <a href=\"%4$@\">%2$@ pelissä %3$@</a>.</p></html>";

/* Subject when sharing an achievement via email. */
"SHARE_ACHIEVEMENT_EMAIL_SUBJECT" = "%@";

/* HTML formatted email body for sharing an unearned achievement for the local player */
"SHARE_ACHIEVEMENT_EMAIL_UNEARNED_LOCAL_PLAYER_BODY" = "<html><p>Haluan ansaita saavutuksen <a href=\"%3$@\">%1$@ pelissä %2$@</a>.</p></html>";

/* Message for sharing your own achievement */
"SHARE_ACHIEVEMENT_LOCAL_PLAYER" = "Ansaitsin saavutuksen %1$@ pelissä %2$@.";

/* Message for sharing someone else's achievement */
"SHARE_ACHIEVEMENT_OTHER_PLAYER" = "%1$@ ansaitsi saavutuksen %2$@ pelissä %3$@.";

/* Message for sharing an achievement you want to earn */
"SHARE_ACHIEVEMENT_UNEARNED_LOCAL_PLAYER" = "Haluan ansaita saavutuksen %1$@ pelissä %2$@.";

/* HTML formatted email body for sharing a score via email. */
"SHARE_SCORE_EMAIL_LOCAL_PLAYER_BODY" = "<html><p>Katso <a href=\"%3$@\">pisteeni pelin %2$@ tulostaulukossa %1$@</a>.</p></html>";

/* HTML formatted email body for sharing a score via email. */
"SHARE_SCORE_EMAIL_OTHER_PLAYER_BODY" = "<html><p>Katso pisteet, jotka <a href=\"%4$@\">%1$@ ansaitsi pelin %3$@ tulostaulukossa %2$@</a>.</p></html>";

/* Subject when sharing a score via email. */
"SHARE_SCORE_EMAIL_SUBJECT" = "%@";

/* Message for sharing your own score */
"SHARE_SCORE_LOCAL_PLAYER" = "Katso pisteeni pelin %2$@ tulostaulukossa %1$@.";

/* Message for sharing someone else's score */
"SHARE_SCORE_OTHER_PLAYER" = "Katso pisteet, jotka %1$@ ansaitsi pelin %3$@ tulostaulukossa %2$@.";

/* Show All */
"SHOW_ALL" = "Näytä kaikki";

/* Show More footer title */
"SHOW_MORE_TEXT" = "Näytä lisää…";

/* Show %@ More cell in Leaderboard */
"SHOW_X_MORE_CELL_IN_LEADERBOARD_FORMAT" = "Näytä %@ lisää…";

/* Sign In Button */
"SIGN_IN_BUTTON" = "Kirjaudu sisään";

/* Sign in header message text */
"SIGN_IN_HEADER_MESSAGE_TEXT" = "Ota Game Center käyttöön Apple ID:llä ja pelaa online-pelejä kaveriesi kanssa - missä tahansa he ovatkin.";

/* Starting Game… */
"STARTING_GAME" = "Aloitetaan peliä…";

/* Tap to rate this game (shown next to rating star control in in-game headers) */
"TAP_TO_RATE_GAME" = "Arvioi napauttamalla";

/* Tap to rate this game (shown next to rating star control in in-game headers) */
"TAP_TO_RATE_GAME_LANDSCAPE" = "Arvioi peli napauttamalla";

/* Tap to rate this game (shown next to rating star control in in-game headers) */
"TAP_TO_RATE_GAME_PORTRAIT" = "Arvioi peli\nnapauttamalla";

/* All Time in leaderboard */
"TIME_SCOPE_ALL_TIME_TITLECASE" = "Yhteensä";

/* All Time in leaderboard iPad All Caps */
"TIME_SCOPE_ALL_TIME_UPPERCASE" = "YHTEENSÄ";

/* This week in leaderboard */
"TIME_SCOPE_THIS_WEEK_TITLECASE" = "Viikko";

/* This week in leaderboard iPad All Caps */
"TIME_SCOPE_THIS_WEEK_UPPERCASE" = "VIIKKO";

/* Today in leaderboard */
"TIME_SCOPE_TODAY_TITLECASE" = "Tänään";

/* Today in leaderboard iPad All Caps */
"TIME_SCOPE_TODAY_UPPERCASE" = "TÄNÄÄN";

/* To: */
"TO_LABEL" = "Vast.ott.:";

/* <truncation symbol> with close quote */
"TRUNCATION_SYMBOL_QUOTE" = "%1$@”";

/* Message for Turn Based Match creation error alert */
"TURN_BASED_CREATE_FAILED_MESSAGE" = "Yritä myöhemmin uudelleen.";

/* Title for Turn Based Match creation error alert */
"TURN_BASED_CREATE_FAILED_TITLE" = "Ei voida arpoa";

/* String indicating a turn based game has finished */
"TURN_BASED_GAME_OVER" = "Peli päättyi";

/* Message for maximum games exceeded alert */
"TURN_BASED_INVITE_MAX_SESSIONS_MESSAGE" = "Poista olemassa oleva peli ja yritä uudelleen.";

/* Title for maximum games exceeded alert */
"TURN_BASED_INVITE_MAX_SESSIONS_TITLE" = "Peliä ei voitu luoda";

/* Message for maximum games exceeded for other alert */
"TURN_BASED_INVITE_OTHER_MAX_SESSIONS_MESSAGE" = "Kutsutulla pelaajalla on liian monta peliä käynnissä.";

/* Title for maximum games exceeded for other player alert */
"TURN_BASED_INVITE_OTHER_MAX_SESSIONS_TITLE" = "Peliä ei voitu luoda";

/* String for describing when you last played a turn based game */
"TURN_BASED_LAST_PLAYED_FORMAT" = "%@";

/* String for describing when a game is new and no one has taken a turn yet */
"TURN_BASED_LAST_PLAYED_NEW_GAME" = "Uusi peli";

/* String for describing when a game is new and no one has taken a turn yet in the session detail view */
"TURN_BASED_LAST_PLAYED_NO_TURN" = "Ei pelattuja vuoroja";

/* Title for quit button when you swipe an invite session cell */
"TURN_BASED_MATCHMAKER_DECLINE" = "Kieltäydy";

/* Title for turn based matches view nav bar title while loading */
"TURN_BASED_MATCHMAKER_GAMES" = "Pelit";

/* Title for turn based matches view nav bar title plural */
"TURN_BASED_MATCHMAKER_GAMES_PLURAL" = "%@ peliä";

/* Title for turn based matches view nav bar title singular */
"TURN_BASED_MATCHMAKER_GAMES_SINGULAR" = "%@ peli";

/* Title for turn based matches view nav bar when there are no active games */
"TURN_BASED_MATCHMAKER_GAMES_ZERO" = "Pelit";

/* Title for invitation detail view control that comes up when user chooses an invitation in turn based gaming session picker */
"TURN_BASED_MATCHMAKER_INVITATION_DETAIL_TITLE" = "Kutsu";

/* Title for quit button when you swipe a current session cell */
"TURN_BASED_MATCHMAKER_QUIT" = "Lopeta peli";

/* String for indicating a player has been invited to a turn based game */
"TURN_BASED_MATCHMAKER_READY" = "Valmiina";

/* Title for quit button when you swipe a current session cell */
"TURN_BASED_MATCHMAKER_REMOVE" = "Poista peli";

/* Title for turn based invitations section header */
"TURN_BASED_MATCHMAKER_SECTION_HEADER_CURRENT_INVITED" = "Kutsut";

/* Title for current sessions section header for another player's turn */
"TURN_BASED_MATCHMAKER_SECTION_HEADER_CURRENT_OTHER_TURN" = "Toisen pelaajan vuoro";

/* description of a participant who has the current turn in the session detail view */
"TURN_BASED_MATCHMAKER_SECTION_HEADER_CURRENT_THIS_PLAYERS_TURN" = "Tämän pelaajan vuoro";

/* Title for current sessions section header for your turn */
"TURN_BASED_MATCHMAKER_SECTION_HEADER_CURRENT_YOUR_TURN" = "Sinun vuorosi";

/* Title for finished sessions section header */
"TURN_BASED_MATCHMAKER_SECTION_HEADER_FINISHED" = "Peli päättyi";

/* Title for take turn button in session detail view */
"TURN_BASED_MATCHMAKER_TAKE_TURN" = "Pelaa vuorosi";

/* Title for view match button in session detail view */
"TURN_BASED_MATCHMAKER_VIEW_MATCH" = "Näytä peli";

/* Invitation from another player */
"TURN_BASED_MATCH_DETAIL_INVITATION_FROM_FORMAT" = "Pelaajalta %@";

/* string for indicating when the last turn taken */
"TURN_BASED_MATCH_DETAIL_LAST_TURN_FORMAT" = "Viimeisin vuoro %@";

/* string for indicating when you don't know the start date of the match */
"TURN_BASED_MATCH_DETAIL_NO_START_DATE" = "Tuntematon aloituspäivä";

/* string for indicating when no turn was taken */
"TURN_BASED_MATCH_DETAIL_NO_TURN_TAKEN" = "Kukaan ei ole pelannut";

/* Text indicating who you played with */
"TURN_BASED_MATCH_DETAIL_PLAYED_WITH_FORMAT_PLURAL" = "Pelattu pelaajan %1$@ ja %2$d muun kanssa";

/* Text indicating who you played with */
"TURN_BASED_MATCH_DETAIL_PLAYED_WITH_FORMAT_SINGULAR" = "Pelikaverina oli %@";

/* Played with auto-match player */
"TURN_BASED_MATCH_DETAIL_PLAYED_WITH_FORMAT_ZERO" = "Pelattu arvotun pelikaverin kanssa";

/* Section header for N players section in session detail view */
"TURN_BASED_MATCH_DETAIL_PLAYERS_FORMAT" = "%d pelaajaa";

/* Text indicating who you are playing with */
"TURN_BASED_MATCH_DETAIL_PLAYING_WITH_FORMAT_PLURAL" = "Pelataan pelaajan %1$@ ja %2$d muun kanssa";

/* Text indicating who you are playing with */
"TURN_BASED_MATCH_DETAIL_PLAYING_WITH_FORMAT_SINGULAR" = "Pelikaveri: %@";

/* Playing with auto-match player */
"TURN_BASED_MATCH_DETAIL_PLAYING_WITH_FORMAT_ZERO" = "Pelataan arvotun pelikaverin kanssa";

/* string for indicating when you started the match */
"TURN_BASED_MATCH_DETAIL_STARTED_FORMAT" = "Aloitettu %@";

/* String for additional info when a player has no turns on the turn based matchmaker view controller */
"TURN_BASED_NO_TURNS_INFO" = "Kutsu kavereita pelaamaan";

/* String for describing when a player has no turns on the turn based matchmaker view controller */
"TURN_BASED_NO_TURNS_STATUS" = "Ei pelejä";

/* String for indicating that it is another player' turn in a turn based game */
"TURN_BASED_OTHER_TURN_FORMAT" = "Vuorossa %@";

/* String for indicating that it is another player's turn in a turn based game, but we don't know their name */
"TURN_BASED_OTHER_TURN_UNKNOWN" = "Hänen vuoronsa";

/* String for indicating that another player won a turn based game */
"TURN_BASED_OTHER_WON_FORMAT" = "%@ voitti";

/* String for indicating that another player won a turn based game, but we don't know their name */
"TURN_BASED_OTHER_WON_UNKNOWN" = "Toinen pelaaja voitti";

/* String for indicating another player */
"TURN_BASED_OUTCOME_ANOTHER_PLAYER" = "Toinen pelaaja";

/* String for conjoining player name and outcome for example 'Bob won' */
"TURN_BASED_OUTCOME_ANOTHER_PLAYER_OUTCOME_FORMAT" = "%1$@: %2$@";

/* String for indicating that a player got first place */
"TURN_BASED_OUTCOME_FIRST" = "1. sija";

/* String for indicating that a player got fourth place */
"TURN_BASED_OUTCOME_FOURTH" = "4. sija";

/* String for indicating that a player was last to lose */
"TURN_BASED_OUTCOME_LOST" = "Hävisi";

/* String for indicating the player that is the local player */
"TURN_BASED_OUTCOME_ME" = "Minä";

/* String for indicating that a player has no outcome */
"TURN_BASED_OUTCOME_NONE" = "Ei tulosta";

/* String for indicating that a player was last to quit */
"TURN_BASED_OUTCOME_QUIT" = "Lopeta";

/* String for indicating that a player got second place */
"TURN_BASED_OUTCOME_SECOND" = "2. sija";

/* String for indicating that a player got third place */
"TURN_BASED_OUTCOME_THIRD" = "3. sija";

/* String for indicating that a player has tied */
"TURN_BASED_OUTCOME_TIED" = "Tasapeli";

/* String for indicating that a player ran out of time */
"TURN_BASED_OUTCOME_TIME_EXP" = "Aika loppui";

/* String for indicating that a player was first to win */
"TURN_BASED_OUTCOME_WON" = "Voitti";

/* String for indicating that the participant status is active */
"TURN_BASED_PARTICIPANT_STATUS_ACTIVE" = "Pelaa";

/* String for indicating that the participant status is declined */
"TURN_BASED_PARTICIPANT_STATUS_DECLINED" = "Kieltäytyi";

/* String for indicating that the participant status is done */
"TURN_BASED_PARTICIPANT_STATUS_DONE" = "Valmis";

/* String for indicating that the participant status is invited */
"TURN_BASED_PARTICIPANT_STATUS_INVITED" = "Kutsuttu";

/* String for indicating that the participant status is matching */
"TURN_BASED_PARTICIPANT_STATUS_MATCHING" = "Arvotaan";

/* format for conjoining status and outcome */
"TURN_BASED_PARTICIPANT_STATUS_OUTCOME_FORMAT" = "%1$@ %2$@";

/* String for indicating that the participant status is unknown */
"TURN_BASED_PARTICIPANT_STATUS_UNKNOWN" = "Tuntematon";

/* String for indicating that it is your turn in a turn based game */
"TURN_BASED_YOUR_TURN" = "Sinun vuorosi";

/* String for indicating that you won a turn based game */
"TURN_BASED_YOU_WON" = "Voitit!";

/* Unable to Load header message */
"UNABLE_TO_LOAD" = "Ei voida ladata";

/* Unable to Load Achievements */
"UNABLE_TO_LOAD_ACHIEVEMENTS" = "Saavutuksia ei voida ladata";

/* Unable to Load Friends message */
"UNABLE_TO_LOAD_FRIENDS" = "Kavereita ei voida ladata";

/* Unable To Load (uppercase) */
"UNABLE_TO_LOAD_UPPERCASE" = "EI VOIDA LADATA";

/* Could not send game rating alert title */
"UNABLE_TO_SUBMIT_GAME_RATING" = "Peliarviota ei voida lähettää nyt. Yritä myöhemmin uudelleen.";

/* Unauthenticated User */
"UNAUTHENTICATED_USER" = "Todentamaton käyttäjä";

/* Unexpected connection alert title */
"UNEXPECTED_CONNECTION_ALERT_HEADER" = "Odottamaton yhteys";

/* Unexpected connection alert message */
"UNEXPECTED_CONNECTION_ALERT_MESSAGE" = "Odottamaton pelaaja liittyi peliin.  Pelikaverin arvonta kumotaan.";

/* Uninvite */
"UNINVITE_BUTTON_TITLE" = "Poista kutsu";

/* Uninvite Now */
"UNINVITE_NOW" = "Poista kutsu nyt";

/* Uninvite Players Alert Header */
"UNINVITE_PLAYERS_ALERT_HEADER" = "Peru kutsuja?";

/* Uninvite Players Alert Message */
"UNINVITE_PLAYERS_ALERT_MESSAGE" = "Osa kutsutuista pelaajista ei ole vielä vastannut.";

/* Unknown player score string */
"UNKNOWN_PLAYER_SCORE" = "--- ";

/* Untitled App */
"UNTITLED_APP" = "Nimetön ohjelma";

/* Username Placeholder */
"USERNAME_PLACEHOLDER" = "Apple ID";

/* Sandbox Username Placeholder */
"USERNAME_PLACEHOLDER_SANDBOX" = "Sandbox Apple ID";

/* View Account Button */
"VIEW_ACCOUNT_BUTTON" = "Näytä tili";

/* View Frined Request Alert Button Title */
"VIEW_FRIEND_REQUEST_BUTTON_TITLE" = "Näytä";

/* Waiting for authentication invite label */
"WAITING_FOR_AUTHENTICATION" = "Odotetaan todennusta…";

/* Waiting for host format string */
"WAITING_FOR_HOST_FORMAT" = "Odotetaan, että %@ aloittaa pelin.";

/* Wait alert button */
"WAIT_ALERT_BUTTON" = "Odota";

/* Welcome back player name message */
"WELCOME_BACK_PLAYER_NAME_MESSAGE_FORMAT" = "Tervetuloa takaisin, %@";

/* Welcome title */
"WELCOME_TITLE" = "Tervetuloa";

/* Welcome to game center player name message */
"WELCOME_TO_GAME_CENTER_PLAYER_NAME_MESSAGE_FORMAT" = "Tervetuloa Game Centeriin, %@";

/* Sandbox prompt */
"XXX_SANDBOX_XXX" = "✭✭✭ Sandbox ✭✭✭";

/* You have selected the maximum number of players. */
"YOU_HAVE_SELECTED_MAXIMUM_NUMBER_OF_PLAYERS" = "Olet valinnut enimmäismäärän pelaajia.";

